; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v3 - type_2 ?v4 - type_1)
 	      (pred_4 ?v6 - object ?v4 - type_1)
	      (pred_2 ?v3 - type_2 ?v1 - type_3)
	      (pred_3 ?v3 - type_2 ?v6 - object ?v1 - type_3))

   (:action op_2
       :parameters  (?v3 - type_2 ?v2 ?v5 - type_1)
       :precondition (and  (pred_1 ?v3 ?v2))
       :effect (and  (pred_1 ?v3 ?v5)
		     (not (pred_1 ?v3 ?v2))))

   (:action op_1
       :parameters (?v3 - type_2 ?v8 - object ?v7 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v7) (pred_1 ?v3 ?v7) (pred_2 ?v3 ?v1))
       :effect (and (pred_3 ?v3 ?v8 ?v1)
		    (not (pred_4 ?v8 ?v7)) 
		    (not (pred_2 ?v3 ?v1))))

   (:action op_3
       :parameters (?v3 - type_2 ?v8 - object ?v7 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v8 ?v1) (pred_1 ?v3 ?v7))
       :effect (and (pred_4 ?v8 ?v7)
		    (pred_2 ?v3 ?v1)
		    (not (pred_3 ?v3 ?v8 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_09 obj_05 - type_2
obj_04 obj_11 obj_13 obj_02 - type_3
obj_14 obj_08 obj_10 obj_03 - type_1
obj_01 obj_12 obj_06 obj_07 - object)
(:init
(pred_1 obj_09 obj_03)
(pred_2 obj_09 obj_04)
(pred_2 obj_09 obj_11)
(pred_1 obj_05 obj_03)
(pred_2 obj_05 obj_13)
(pred_2 obj_05 obj_02)
(pred_4 obj_01 obj_08)
(pred_4 obj_12 obj_03)
(pred_4 obj_06 obj_14)
(pred_4 obj_07 obj_10)
)
(:goal
(and
(pred_4 obj_01 obj_10)
(pred_4 obj_12 obj_08)
(pred_4 obj_06 obj_14)
(pred_4 obj_07 obj_03)
)
)

(:constraints
  (always (not (pred_1 obj_09 obj_10)))
)
)

; plan
1. (op_1 obj_09 obj_12 obj_03 obj_11)
   deleted: (pred_4 obj_12 obj_03) (pred_2 obj_09 obj_11)
   added: (pred_3 obj_09 obj_12 obj_11)
   goals met: 1 of 4
2. (op_2 obj_05 obj_03 obj_10)
   deleted: (pred_1 obj_05 obj_03)
   added: (pred_1 obj_05 obj_10)
   goals met: 1 of 4
3. (op_2 obj_09 obj_03 obj_08)
   deleted: (pred_1 obj_09 obj_03)
   added: (pred_1 obj_09 obj_08)
   goals met: 1 of 4
4. (op_1 obj_05 obj_07 obj_10 obj_02)
   deleted: (pred_4 obj_07 obj_10) (pred_2 obj_05 obj_02)
   added: (pred_3 obj_05 obj_07 obj_02)
   goals met: 1 of 4
5. (op_3 obj_09 obj_12 obj_08 obj_11)
   deleted: (pred_3 obj_09 obj_12 obj_11)
   added: (pred_4 obj_12 obj_08) (pred_2 obj_09 obj_11)
   goals met: 2 of 4
6. (op_2 obj_05 obj_10 obj_03)
   deleted: (pred_1 obj_05 obj_10)
   added: (pred_1 obj_05 obj_03)
   goals met: 2 of 4
7. (op_1 obj_09 obj_01 obj_08 obj_11)
   deleted: (pred_4 obj_01 obj_08) (pred_2 obj_09 obj_11)
   added: (pred_3 obj_09 obj_01 obj_11)
   goals met: 2 of 4
8. (op_3 obj_05 obj_07 obj_03 obj_02)
   deleted: (pred_3 obj_05 obj_07 obj_02)
   added: (pred_4 obj_07 obj_03) (pred_2 obj_05 obj_02)
   goals met: 3 of 4
9. (op_2 obj_05 obj_03 obj_08)
   deleted: (pred_1 obj_05 obj_03)
   added: (pred_1 obj_05 obj_08)
   goals met: 3 of 4
10. (op_3 obj_09 obj_01 obj_08 obj_11)
   deleted: (pred_3 obj_09 obj_01 obj_11)
   added: (pred_4 obj_01 obj_08) (pred_2 obj_09 obj_11)
   goals met: 3 of 4
11. (op_1 obj_05 obj_01 obj_08 obj_02)
   deleted: (pred_4 obj_01 obj_08) (pred_2 obj_05 obj_02)
   added: (pred_3 obj_05 obj_01 obj_02)
   goals met: 3 of 4
12. (op_2 obj_05 obj_08 obj_10)
   deleted: (pred_1 obj_05 obj_08)
   added: (pred_1 obj_05 obj_10)
   goals met: 3 of 4
13. (op_3 obj_05 obj_01 obj_10 obj_02)
   deleted: (pred_3 obj_05 obj_01 obj_02)
   added: (pred_4 obj_01 obj_10) (pred_2 obj_05 obj_02)
   goals met: 4 of 4
